erpdev.СХК_Расширение/src/DataProcessors/СХК_ЗаполнитьСписание/СХК_ЗаполнитьСписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_ЗаполнитьСписание</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/DataProcessors/СХК_ЗаполнитьСписание/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Док = ЭтаФорма.ДокСписания.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	               |	СУММА(СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОст, ) КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток < &ВНаличииОстаток
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка";
	
	Запрос.УстановитьПараметр("ДатаОст", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВНаличииОстаток", 0);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Док.Товары.Очистить();
	а = 1;
	Для Каждого стр из Рез Цикл
		Т = Док.Товары.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Серия = стр.Серия;
		Т.Количество = стр.ВНаличииОстаток*(-1);
		Т.Ячейка = стр.Ячейка;
		
	КонецЦикла;

	
	
	Док.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
